cmsis-svd/cmsis-svd/data/Atmel/ATSAMV70J20.svd
            <register>
               <name>TSCV</name>
               <description>Timestamp Counter Value Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TSC</name>
                     <description>Timestamp Counter (cleared on write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOCC</name>
               <description>Timeout Counter Configuration Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ETOC</name>
                     <description>Enable Timeout Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ETOCSelect</name>
                        <enumeratedValue>
                           <name>NO_TIMEOUT</name>
                           <description>Timeout Counter disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOS_CONTROLLED</name>
                           <description>Timeout Counter enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOS</name>
                     <description>Timeout Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TOSSelect</name>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>Continuous operation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX_EV_TIMEOUT</name>
                           <description>Timeout controlled by Tx Event FIFO</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RX0_EV_TIMEOUT</name>
                           <description>Timeout controlled by Receive FIFO 0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RX1_EV_TIMEOUT</name>
                           <description>Timeout controlled by Receive FIFO 1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOP</name>
                     <description>Timeout Period</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOCV</name>
               <description>Timeout Counter Value Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TOC</name>
                     <description>Timeout Counter (cleared on write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECR</name>
               <description>Error Counter Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TEC</name>
                     <description>Transmit Error Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REC</name>
                     <description>Receive Error Counter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>RP</name>
                     <description>Receive Error Passive</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEL</name>
                     <description>CAN Error Logging (cleared on read)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSR</name>
               <description>Protocol Status Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LEC</name>
                     <description>Last Error Code (set to 111 on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LECSelect</name>
                        <enumeratedValue>
                           <name>NO_ERROR</name>
                           <description>No error occurred since LEC has been reset by successful reception or transmission.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUFF_ERROR</name>
                           <description>More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORM_ERROR</name>
                           <description>A fixed format part of a received frame has the wrong format.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACK_ERROR</name>
                           <description>The message transmitted by the MCAN was not acknowledged by another node.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT1_ERROR</name>
                           <description>During the transmission of a message (with the exception of the arbitration field), the device wanted to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT0_ERROR</name>
                           <description>During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed).</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC_ERROR</name>
                           <description>The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match with the CRC calculated from the received data.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows the value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ACTSelect</name>
                        <enumeratedValue>
                           <name>SYNCHRONIZING</name>
                           <description>Node is synchronizing on CAN communication</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>Node is neither receiver nor transmitter</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RECEIVER</name>
                           <description>Node is operating as receiver</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSMITTER</name>
                           <description>Node is operating as transmitter</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EP</name>
                     <description>Error Passive</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EW</name>
                     <description>Warning Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BO</name>
                     <description>Bus_Off Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLEC</name>
                     <description>Fast Last Error Code (set to 111 on read)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RESI</name>
                     <description>ESI Flag of Last Received CAN FD Message (cleared on read)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RBRS</name>
                     <description>BRS Flag of Last Received CAN FD Message (cleared on read)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REDL</name>
                     <description>Received a CAN FD Message (cleared on read)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IR</name>
               <description>Interrupt Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RF0N</name>
                     <description>Receive FIFO 0 New Message</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0W</name>
                     <description>Receive FIFO 0 Watermark Reached</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0F</name>
                     <description>Receive FIFO 0 Full</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0L</name>
                     <description>Receive FIFO 0 Message Lost</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1N</name>
                     <description>Receive FIFO 1 New Message</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1W</name>
                     <description>Receive FIFO 1 Watermark Reached</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1F</name>
                     <description>Receive FIFO 1 Full</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1L</name>
                     <description>Receive FIFO 1 Message Lost</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPM</name>
                     <description>High Priority Message</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC</name>
                     <description>Transmission Completed</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCF</name>
                     <description>Transmission Cancellation Finished</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFE</name>
                     <description>Tx FIFO Empty</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFN</name>
                     <description>Tx Event FIFO New Entry</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFW</name>
                     <description>Tx Event FIFO Watermark Reached</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFF</name>
                     <description>Tx Event FIFO Full</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFL</name>
                     <description>Tx Event FIFO Element Lost</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSW</name>
                     <description>Timestamp Wraparound</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MRAF</name>
                     <description>Message RAM Access Failure</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOO</name>
                     <description>Timeout Occurred</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRX</name>
                     <description>Message stored to Dedicated Receive Buffer</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ELO</name>
                     <description>Error Logging Overflow</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP</name>
                     <description>Error Passive</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EW</name>
                     <description>Warning Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BO</name>
                     <description>Bus_Off Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDI</name>
                     <description>Watchdog Interrupt</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCE</name>
                     <description>CRC Error</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BE</name>
                     <description>Bit Error</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACKE</name>
                     <description>Acknowledge Error</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FOE</name>
                     <description>Format Error</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STE</name>
                     <description>Stuff Error</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
