cmsis-svd/cmsis-svd/data/Atmel/ATSAMV70J20.svd
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSTPIPCFG[%s]</name>
               <description>Host Pipe Configuration Register (n = 0) 0</description>
               <addressOffset>0x500</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ALLOC</name>
                     <description>Pipe Memory Allocate</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PBK</name>
                     <description>Pipe Banks</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PBKSelect</name>
                        <enumeratedValue>
                           <name>_1_BANK</name>
                           <description>Single-bank pipe</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BANK</name>
                           <description>Double-bank pipe</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BANK</name>
                           <description>Triple-bank pipe</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PSIZE</name>
                     <description>Pipe Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PSIZESelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8 bytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16 bytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32 bytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64 bytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128_BYTE</name>
                           <description>128 bytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256_BYTE</name>
                           <description>256 bytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512_BYTE</name>
                           <description>512 bytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024_BYTE</name>
                           <description>1024 bytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PTOKEN</name>
                     <description>Pipe Token</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PTOKENSelect</name>
                        <enumeratedValue>
                           <name>SETUP</name>
                           <description>SETUP</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IN</name>
                           <description>IN</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUT</name>
                           <description>OUT</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AUTOSW</name>
                     <description>Automatic Switch</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTYPE</name>
                     <description>Pipe Type</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PTYPESelect</name>
                        <enumeratedValue>
                           <name>CTRL</name>
                           <description>Control</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ISO</name>
                           <description>Isochronous</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BLK</name>
                           <description>Bulk</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTRPT</name>
                           <description>Interrupt</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PEPNUM</name>
                     <description>Pipe Endpoint Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>INTFRQ</name>
                     <description>Pipe Interrupt Request Frequency</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSTPIPISR[%s]</name>
               <description>Host Pipe Status Register (n = 0) 0</description>
               <addressOffset>0x530</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXINI</name>
                     <description>Received IN Data Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTI</name>
                     <description>Transmitted OUT Data Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSTPI</name>
                     <description>Transmitted SETUP Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERRI</name>
                     <description>Pipe Error Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDI</name>
                     <description>NAKed Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFI</name>
                     <description>Overflow Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDI</name>
                     <description>Received STALLed Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETI</name>
                     <description>Short Packet Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTSEQ</name>
                     <description>Data Toggle Sequence</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DTSEQSelect</name>
                        <enumeratedValue>
                           <name>DATA0</name>
                           <description>Data0 toggle sequence</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA1</name>
                           <description>Data1 toggle sequence</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NBUSYBK</name>
                     <description>Number of Busy Banks</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NBUSYBKSelect</name>
                        <enumeratedValue>
                           <name>_0_BUSY</name>
                           <description>0 busy bank (all banks free)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1_BUSY</name>
                           <description>1 busy bank</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BUSY</name>
                           <description>2 busy banks</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BUSY</name>
                           <description>3 busy banks</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURRBK</name>
                     <description>Current Bank</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CURRBKSelect</name>
                        <enumeratedValue>
                           <name>BANK0</name>
                           <description>Current bank is bank0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK1</name>
                           <description>Current bank is bank1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK2</name>
                           <description>Current bank is bank2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RWALL</name>
                     <description>Read/Write Allowed</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGOK</name>
                     <description>Configuration OK Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PBYCT</name>
                     <description>Pipe Byte Count</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSTPIPICR[%s]</name>
               <description>Host Pipe Clear Register (n = 0) 0</description>
               <addressOffset>0x560</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXINIC</name>
                     <description>Received IN Data Interrupt Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTIC</name>
                     <description>Transmitted OUT Data Interrupt Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSTPIC</name>
                     <description>Transmitted SETUP Interrupt Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDIC</name>
                     <description>NAKed Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFIC</name>
                     <description>Overflow Interrupt Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDIC</name>
                     <description>Received STALLed Interrupt Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETIC</name>
                     <description>Short Packet Interrupt Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSTPIPIFR[%s]</name>
               <description>Host Pipe Set Register (n = 0) 0</description>
               <addressOffset>0x590</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXINIS</name>
                     <description>Received IN Data Interrupt Set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTIS</name>
                     <description>Transmitted OUT Data Interrupt Set</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSTPIS</name>
                     <description>Transmitted SETUP Interrupt Set</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERRIS</name>
                     <description>Pipe Error Interrupt Set</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDIS</name>
                     <description>NAKed Interrupt Set</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFIS</name>
                     <description>Overflow Interrupt Set</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDIS</name>
                     <description>Received STALLed Interrupt Set</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETIS</name>
                     <description>Short Packet Interrupt Set</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBKS</name>
                     <description>Number of Busy Banks Set</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSTPIPIMR[%s]</name>
               <description>Host Pipe Mask Register (n = 0) 0</description>
               <addressOffset>0x5C0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXINE</name>
                     <description>Received IN Data Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTE</name>
                     <description>Transmitted OUT Data Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSTPE</name>
                     <description>Transmitted SETUP Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERRE</name>
                     <description>Pipe Error Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDE</name>
                     <description>NAKed Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFIE</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDE</name>
                     <description>Received STALLed Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETIE</name>
                     <description>Short Packet Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBKE</name>
                     <description>Number of Busy Banks Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOCON</name>
                     <description>FIFO Control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDISHDMA</name>
                     <description>Pipe Interrupts Disable HDMA Request Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFREEZE</name>
                     <description>Pipe Freeze</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTDT</name>
                     <description>Reset Data Toggle</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
